[
  {
    "title": "Your Addiction Isn’t a Moral Failing, It’s a Nervous System Problem",
    "slug": "your-addiction-isnt-a-moral-failing-its-a-nervous-system-problem",
    "excerpt": "Stop blaming yourself. Learn how addiction is a biological response to trauma and a dysregulated nervous system, and how a trauma-informed approach can finally set you free.",
    "content": "For decades, we’ve been told a story about addiction: that it’s a choice, a moral failing, a lack of willpower. We’ve been shamed, blamed, and punished. We’ve been told to “just say no,” to “hit rock bottom,” to “try harder.”\n\nAnd it hasn’t worked.\n\nWhat if that entire story is wrong? What if your addiction isn’t a sign that you’re weak or broken, but a sign that your nervous system is overwhelmed and dysregulated?\n\nThis is the core principle of a trauma-informed approach to recovery. It’s a par...",
    "category": "Recovery",
    "tags": [
      "recovery",
      "trauma",
      "addiction"
    ]
  },
  {
    "title": "The Most Underrated Tool in Recovery: Self-Compassion",
    "slug": "the-most-underrated-tool-in-recovery-self-compassion",
    "excerpt": "Stop beating yourself up. Discover the science-backed power of self-compassion in addiction recovery and learn a simple practice to break the cycle of shame and relapse.",
    "content": "In the world of addiction recovery, we talk a lot about tough love, hitting rock bottom, and radical honesty. We’re told to take a fearless moral inventory and to admit our wrongs. These are powerful and necessary tools.\n\nBut there’s another tool, one that is often overlooked, dismissed, or misunderstood, that may be the single most important factor in long-term, sustainable recovery: **self-compassion.**\n\nFor many of us, the idea of being kind to ourselves feels foreign, self-indulgent, or just...",
    "category": "Recovery",
    "tags": [
      "recovery",
      "trauma",
      "addiction"
    ]
  },
  {
    "title": "Why Your Inner Child Might Be Driving Your Addiction",
    "slug": "why-your-inner-child-might-be-driving-your-addiction",
    "excerpt": "Explore the powerful connection between childhood wounds and adult addiction. Learn how healing your “inner child” is a critical, and often missing, piece of sustainable recovery.",
    "content": "Does this sound familiar? You’re an adult. You’re responsible. You have a job, a family, a life. But sometimes, you react to situations in ways that feel… childish. A small criticism sends you into a spiral of shame. A minor setback feels like the end of the world. You have an intense, overwhelming need for validation, or you run from intimacy, or you find yourself throwing a tantrum when you don’t get your way.\n\nAnd often, these are the moments right before you pick up a drink or a drug.\n\nWhat ...",
    "category": "Recovery",
    "tags": [
      "recovery",
      "trauma",
      "addiction"
    ]
  },
  {
    "title": "Why You Can't Think Your Way Out of Trauma (And What to Do Instead)",
    "slug": "why-you-cant-think-your-way-out-of-trauma-and-what-to-do-instead",
    "excerpt": "If talk therapy hasn't been enough to heal your trauma and addiction, there's a reason. Learn why trauma lives in the body and how somatic (body-based) practices are essential for release and recovery.",
    "content": "For years, the primary approach to mental health and addiction has been “top-down.” We engage in talk therapy to understand our past, challenge our negative beliefs, and change our thought patterns. This work is incredibly valuable. But for many who have experienced trauma, it’s not enough.\n\nYou can understand your trauma perfectly. You can know, intellectually, that the past is over and you are safe now. But you still feel it in your body. The chronic anxiety. The muscle tension. The digestive ...",
    "category": "Recovery",
    "tags": [
      "recovery",
      "trauma",
      "addiction"
    ]
  },
  {
    "title": "Beyond Sobriety: Introducing the REWIRED Method for Lasting Recovery",
    "slug": "beyond-sobriety-introducing-the-rewired-method-for-lasting-recovery",
    "excerpt": "Sobriety is just the beginning. Discover the REWIRED method, a comprehensive, trauma-informed framework for healing the root causes of addiction and building a life you don’t need to escape from.",
    "content": "What if getting sober isn’t the goal?\n\nThat might sound like a strange thing to say on a website about addiction recovery. But stay with me.\n\nFor most people, the focus is entirely on abstinence. On not drinking. On not using. On counting days. And while sobriety is a necessary and life-saving first step, it is not the destination. It is the ticket to the dance. It is not the dance itself.\n\nWhat is the dance? It’s recovery. It’s healing. It’s building a life that is so connected, so meaningful, ...",
    "category": "Recovery",
    "tags": [
      "recovery",
      "trauma",
      "addiction"
    ]
  }
]